Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotInputModifiers
The Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotInputModifiers enum provides the input modifiers.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotInputModifiers.None
No input modifiers.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotInputModifiers.PrimaryClick
The primary button, in general this is the left mouse button.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotInputModifiers.SecondaryClick
The secondary button, in general this is the right mouse button.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotInputModifiers.TertiaryClick
The tertiary button, in general this is the middle mouse button.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotInputModifiers.Shift
The SHIFT key, indicating an addition to the selection.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotInputModifiers.Alt
The Alt key, indicating a special, yet undefined, action.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotInputModifiers.Ctrl
The CTRL key, indicating a selection toggle.